In [1]:
import pandas as pd
import numpy as np
import os
import os.path as osp

In [2]:
dataset_abs_path = '/Users/myZZUNG/myworkspace/posco_ai_challenge/dataset/1. 도전과제/'
dataset_name = '[과제3] 식당 메뉴 및 식사인원.xlsx'

In [3]:
data1 = pd.read_excel(osp.join(dataset_abs_path, dataset_name), sheet_name=1)

In [4]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 33282 entries, 1 to 33282
Data columns (total 3 columns):
매출일자        33282 non-null int64
품명          33282 non-null object
수량          32248 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.0+ MB

In [5]:
data1.head(5)

   매출일자          품명           수량
1  20030301  아침식사      37.472924
2  20030301  점심식사      31.191336
3  20030301  저녁식사      19.566787
4  20030302  아침식사      36.101083
5  20030302  점심식사      33.357401

In [6]:
data1.tail(5)

       매출일자                 품명          수량
33278  20171231         점심식사      4.693141
33279  20171231        점심식사1      3.465704
33280  20171231         저녁식사      3.249097
33281  20171231        저녁식사1      7.797834
33282  20171231  점심식사2(양식)        3.610108

In [7]:
data2 = pd.read_excel(osp.join(dataset_abs_path, dataset_name), sheet_name=2)

In [8]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24860 entries, 1 to 24860
Data columns (total 3 columns):
일자      24860 non-null int64
식사명     24860 non-null object
식사내용    24860 non-null object
dtypes: int64(1), object(2)
memory usage: 776.9+ KB

In [9]:
data2.head(5)

         일자    식사명                                              식사내용
1  20030301   아침식사                    과일샐러드,닭죽,돈육마늘장조림,떡만두국,부추김무침,쌀밥
2  20030301  아침식사2  딸기잼(중),비엔나구이,스크램블에그(경양식),야채샐러드,크림스프(경양식),토스트&모닝빵
3  20030301   점심식사                  골뱅이야채무침,새우맛살튀김,쌀밥(사무직),열무겉절이,칼국수
4  20030301   저녁식사                       감자으깸샐러드,비프까스,스위트피클,쌀밥,옥수수스프
5  20030302   아침식사                  계란죽,곤약멸치조림,김치국,마카로니샐러드,쌀밥,오징어회무침

In [10]:
data2.tail(5)

             일자    식사명                                               식사내용
24856  20171230  점심식사2              단무지,돈까스,메추리알꽃맛살샐러드,배추김치,쌀밥,야채샐러드,야채스프
24857  20171231   아침식사  김가루잔파무침,누룽지,두유,배추김치,식빵&딸기잼,쌀밥,야채샐러드,오징어두루치기,탕국...
24858  20171231   점심식사      계란파국,깍두기(손칼),날치알김치덮밥,생선까스&타르,쌀밥,오이생채,케이준치킨샐러드
24859  20171231   저녁식사                      깍두기(손칼),닭살떡국,미트볼고추장조림,부추장떡,쌀밥
24860  20171231  점심식사2            깍두기(손칼),식빵&딸기잼,쌀밥,야채샐러드,옥수수스프,피클,함박스테이크

### 이거 두 데이터를 합칠 필요가 있을듯? 중간에 빠진건 빠진대로 넣어야할 듯

In [11]:
data1.keys()

Index(['매출일자    ', '품명  ', '수량'], dtype='object')

In [12]:
convert_df = pd.DataFrame(columns=['datetime', 'product_name', 'volume', 'contents'])

In [13]:
convert_df['datetime'] = data1[data1.columns[0]]
convert_df['product_name'] = data1[data1.columns[1]]
convert_df['volume'] = data1[data1.columns[2]]

In [14]:
convert_df.head(5)

   datetime product_name     volume contents
1  20030301     아침식사      37.472924      NaN
2  20030301     점심식사      31.191336      NaN
3  20030301     저녁식사      19.566787      NaN
4  20030302     아침식사      36.101083      NaN
5  20030302     점심식사      33.357401      NaN

In [16]:
def process_data1(df):
    ret_df = pd.DataFrame(columns=['datetime', 'product_name', 'volume', 'contents'])
    for each_row in df.iterrows():
        datetime = each_row[1][0]
        product_name = each_row[1][1]
        volume = float(each_row[1][2])
        if 
        print(datetime, product_name, volume)
        break

In [17]:
process_data1(convert_df)

20030301 아침식사     37.47292418772563